### NumPy

Задание 1

In [1]:
import numpy as np

In [2]:
a = np.array([[1, 6],
             [2, 8],
             [3, 11],
             [3, 10],
             [1, 7]])

In [3]:
mean_a = np.array(a.mean(axis=0))

In [4]:
print(mean_a)

[2.  8.4]

Задание 2

In [5]:
a_centered = a - mean_a

In [6]:
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

Задание 3

In [7]:
a_centered_sp = a_centered[:, [0]].flatten() @ a_centered[:, [1]].flatten()

In [8]:
print(a_centered_sp)

8.0

In [9]:
a_centered_sp / (a.shape[0] - 1)

2.0

Задание 4**

In [10]:
np.cov(a.T)

array([[1. , 2. ],
       [2. , 4.3]])

In [11]:
np.cov(a.T)[0, 1]

2.0

### Pandas

Задание 1

In [12]:
import pandas as pd

In [13]:
authors = pd.DataFrame({
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
})

In [14]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [15]:
book = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
})

In [16]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [17]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [18]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [19]:
authors_price['min_price'] = authors_price['price']
authors_price['max_price'] = authors_price['price']
authors_price['mean_price'] = authors_price['price']
authors_price

,author_id,author_name,book_title,price,min_price,max_price,mean_price
0,1,Тургенев,Отцы и дети,450,450,450,450
1,1,Тургенев,Рудин,300,300,300,300
2,1,Тургенев,Дворянское гнездо,350,350,350,350
3,2,Чехов,Толстый и тонкий,500,500,500,500
4,2,Чехов,Дама с собачкой,450,450,450,450
5,3,Островский,Гроза,370,370,370,370
6,3,Островский,Таланты и поклонники,290,290,290,290

In [20]:
authors_stat = authors_price.groupby('author_name').agg({'min_price': 'min', 'max_price': 'max', 'mean_price': 'mean'})
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [21]:
authors_price.drop('min_price', axis=1, inplace=True)
authors_price.drop('max_price', axis=1, inplace=True)
authors_price.drop('mean_price', axis=1, inplace=True)
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 5**

In [22]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [24]:
?pd.pivot_table